{
    "authorization": {
      "01": {
        "message": "Access denied to service (permission does not exist)",
        "details": "The user does not have permission to access the service. The user group lacks the required privileges."
      },
      "02": {
        "message": "Access denied to service, user blocked by firewall",
        "details": "Access to the service has been blocked for this user due to firewall settings."
      },
      "03": {
        "message": "Access denied to service, incorrect api_key",
        "details": "Access to the service has been denied due to an incorrect api_key."
      },
      "04": {
        "message": "Access denied to service, incorrect service_key",
        "details": "Access to the service has been denied due to an incorrect service_key."
      },
      "05": {
        "message": "Access denied to service, recent transaction",
        "details": "Access to the service has been denied due to a recent transaction that requires processing time."
      }
    },
    "authentication": {
        "01": {
          "message": "User not found in the database, login failed",
          "details": "We couldn't find your account in our database. Your login attempt has failed."
        },
        "02": {
          "message": "Your session has expired or doesn't exist",
          "details": "Your session has expired or doesn't exist. Please log in again."
        },
        "03": {
          "message": "Your session has expired",
          "details": "Your session has expired for security reasons. Please log in again."
        },
        "04": {
          "message": "Invalid authentication token",
          "details": "The authentication token you provided is not valid. Please check and try again."
        },
        "05": {
          "message": "Authentication failed",
          "details": "Authentication failed. Your provided token does not match our records."
        },
        "06": {
          "message": "Logout failed",
          "details": "We couldn't log you out because there is no active session for your account."
        }
    }
}
  